In [3]:
import pandas as pd

In [7]:
DIR = './data/'

def count_top3(years):
    data = map(lambda x: pd.read_csv(f'{DIR}yob{x}.txt',header=None,names=['Name','Gender','Quantity']),years)
    return pd.concat(data).groupby(['Name']).sum().sort_values('Quantity',ascending=None)[:3]

def count_dynamics(years):
    data = map(lambda x: pd.read_csv(f'{DIR}yob{x}.txt',header=None,names=['Name','Gender','Quantity']).assign(Year=x),years)
    return pd.concat(data).groupby(['Year','Gender']).sum().unstack('Year')

In [8]:
count_top3([1880])

         Quantity
Name
John         9701
William      9562
Mary         7092

In [9]:
count_top3([1900, 1950, 2000])

        Quantity
Name
James     111789
John      109601
Robert    101368

In [10]:
count_dynamics([1900, 1950, 2000])

       Quantity
Year       1900     1950     2000
Gender
F        299798  1713065  1815295
M        150480  1790437  1963202